InformationRegisters/ЭАрМ_ОжидаемыеПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭАрМ_ОжидаемыеПодтвержденияЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЭАрМ_ОбщийМодуль/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик подписки на запись входящего ЭДО.
// Вызывается при записи документа ЭлектронныйДокументВходящийЭДО.
//
Процедура ЭАрМ_ПриЗаписиВходящегоЭДО(Источник, Отказ) Экспорт

	ВидДокумента = Источник.ВидДокумента;
	Если НЕ ЗначениеЗаполнено(ВидДокумента) Тогда
		Возврат;
	КонецЕсли;

	ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ТипДокумента");

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ПодпискаВходящий",
		УровеньЖурналаРегистрации.Информация, , Источник.Ссылка,
		СтрШаблон("Тип: %1", ТипДокумента));

	Если ТипДокумента <> Перечисления.ТипыДокументовЭДО.ЭТрН Тогда
		Возврат;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ПодпискаВходящий",
		УровеньЖурналаРегистрации.Информация, , Источник.Ссылка,
		"ЭТрН обнаружен → обработка");

	ОбработатьВходящийЭТрН(Источник.Ссылка);

КонецПроцедуры

// Обработчик подписки на событие записи состояния ЭДО.
// Вызывается при записи в регистр СостоянияПоОбъектамУчетаЭДО.
//
Процедура ЭАрМ_ПриЗаписиСостоянияПоОбъектамУчетаЭДО(Источник, Отказ, Замещение) Экспорт

	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Запись Из Источник Цикл

		СсылкаНаОбъект = Запись.СсылкаНаОбъект;

		//@skip-check query-in-loop
		ЭлектронныеДокументы = НайтиЭлектронныеДокументыПоОбъектуУчета(СсылкаНаОбъект);

		Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл

			ВидДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ЭлектронныйДокумент, "ВидДокумента");
			ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ВидДокумента, "ТипДокумента");

			Если НЕ ЭтоПоддерживаемыйТипДокумента(ТипДокумента) Тогда
				Продолжить;
			КонецЕсли;

			//@skip-check query-in-loop
			Если УжеОтправленНаПодтверждение(ЭлектронныйДокумент) Тогда
				Продолжить;
			КонецЕсли;

			ЭАрМ_ОбработкаПодтвержденийЭДО.ОтправитьНаПодтверждение(ЭлектронныйДокумент);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияСБИС

// Главная точка входа для обработки документов из СБИС.
// Аутентифицируется, получает входящие документы, обрабатывает, отправляет ответ.
//
// Возвращаемое значение:
//   Структура - Обработано (Число), Ошибки (Массив)
//
Функция ОбработатьДокументыСБИС() Экспорт

	Результат = Новый Структура("Обработано, Ошибки", 0, Новый Массив);

	ИспользоватьСБИС = ПолучитьНастройкуСБИС("ИспользоватьСБИС", Ложь);
	Если ИспользоватьСБИС <> Истина Тогда
		Возврат Результат;
	КонецЕсли;

	ЛогинСБИС = ПолучитьНастройкуСБИС("ЛогинСБИС", "");
	ПарольСБИС = ПолучитьНастройкуСБИС("ПарольСБИС", "");

	Если НЕ ЗначениеЗаполнено(ЛогинСБИС) ИЛИ НЕ ЗначениеЗаполнено(ПарольСБИС) Then
		ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не заполнены логин/пароль для СБИС");
		Возврат Результат;
	КонецЕсли;

	// 1. Аутентификация
	ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
		УровеньЖурналаРегистрации.Информация, , ,
		"Аутентификация в СБИС...");

	AuthТокен = АутентифицироватьСБИС(ЛогинСБИС, ПарольСБИС);
	Если AuthТокен = Неопределено Тогда
		Результат.Ошибки.Добавить("Ошибка аутентификации в СБИС");
		ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка аутентификации");
		Возврат Результат;
	КонецЕсли;

	// 2. Получение списка входящих документов
	СписокДокументов = ПолучитьСписокДокументовСБИС(AuthТокен);
	Если СписокДокументов = Неопределено Тогда
		Результат.Ошибки.Добавить("Ошибка получения списка документов из СБИС");
		ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка получения списка документов");
		Возврат Результат;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон("Найдено документов: %1", СписокДокументов.Количество()));

	// 3. Обработка каждого документа
	Для Каждого Элемент Из СписокДокументов Цикл

		ИдентификаторДокумента = "";
		Элемент.Свойство("Идентификатор", ИдентификаторДокумента);

		Попытка
			// Получение содержимого документа
			ДанныеДокумента = ПолучитьДокументСБИС(AuthТокен, ИдентификаторДокумента);
			Если ДанныеДокумента = Неопределено Тогда
				Результат.Ошибки.Добавить(
					СтрШаблон("Не удалось получить документ %1", ИдентификаторДокумента));
				Продолжить;
			КонецЕсли;

			// Обработка документа
			РезультатОбработки = ЭАрМ_ПриемДокументовДалион.ПринятьДокументЧерезHTTP(ДанныеДокумента);

			// Отправка результата обратно в СБИС
			СостояниеСБИС = ?(РезультатОбработки.Принято, "Принят", "ОшибкаОбработки");
			ОтправитьРезультатСБИС(AuthТокен, ИдентификаторДокумента,
				СостояниеСБИС, РезультатОбработки.Комментарий);

			Результат.Обработано = Результат.Обработано + 1;

			ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
				УровеньЖурналаРегистрации.Информация, , ,
				СтрШаблон("Документ %1 обработан: %2",
					ИдентификаторДокумента, РезультатОбработки.Комментарий));

		Исключение
			ТекстОшибки = СтрШаблон("Ошибка %1: %2",
				ИдентификаторДокумента,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Результат.Ошибки.Добавить(ТекстОшибки);
			ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
				УровеньЖурналаРегистрации.Ошибка, , ,
				ТекстОшибки);
		КонецПопытки;

	КонецЦикла;

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон("Итого: обработано=%1, ошибок=%2",
			Результат.Обработано, Результат.Ошибки.Количество()));

	Возврат Результат;

КонецФункции

// Аутентификация в СБИС, получение auth_token.
//
Функция АутентифицироватьСБИС(Логин, Пароль)

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("jsonrpc", "2.0");
	ТелоЗапроса.Вставить("method", "СБИС.Аутентифицировать");
	ТелоЗапроса.Вставить("id", 0);

	Параметры = Новый Структура;
	Параметры.Вставить("Логин", Логин);
	Параметры.Вставить("Пароль", Пароль);
	ТелоЗапроса.Вставить("params", Параметры);

	Ответ = ВыполнитьЗапросСБИС("https://online.sbis.ru/auth/service/", ТелоЗапроса);
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	РезультатЗапроса = Неопределено;
	Ответ.Свойство("result", РезультатЗапроса);
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	AuthТокен = "";
	РезультатЗапроса.Свойство("auth_token", AuthТокен);

	Возврат ?(ЗначениеЗаполнено(AuthТокен), AuthТокен, Неопределено);

КонецФункции

// Получение списка входящих документов из СБИС.
//
Функция ПолучитьСписокДокументовСБИС(AuthТокен)

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("jsonrpc", "2.0");
	ТелоЗапроса.Вставить("method", "СБИС.ПолучитьСписокДокументов");
	ТелоЗапроса.Вставить("id", 1);

	Параметры = Новый Структура;
	Параметры.Вставить("Направление", "Входящий");
	Параметры.Вставить("Состояние", "Новый");
	Параметры.Вставить("Страница", 1);
	Параметры.Вставить("РазмерСтраницы", 50);
	ТелоЗапроса.Вставить("params", Параметры);

	Ответ = ВыполнитьЗапросСБИС("https://online.sbis.ru/service/rpc/", ТелоЗапроса, AuthТокен);
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	РезультатЗапроса = Неопределено;
	Ответ.Свойство("result", РезультатЗапроса);
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;

	СписокДокументов = Неопределено;
	РезультатЗапроса.Свойство("Документы", СписокДокументов);

	Возврат ?(СписокДокументов <> Неопределено, СписокДокументов, Новый Массив);

КонецФункции

// Получение содержимого документа из СБИС.
//
Функция ПолучитьДокументСБИС(AuthТокен, ИдентификаторДокумента)

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("jsonrpc", "2.0");
	ТелоЗапроса.Вставить("method", "СБИС.ПолучитьДокумент");
	ТелоЗапроса.Вставить("id", 2);

	Параметры = Новый Структура;
	Параметры.Вставить("Идентификатор", ИдентификаторДокумента);
	ТелоЗапроса.Вставить("params", Параметры);

	Ответ = ВыполнитьЗапросСБИС("https://online.sbis.ru/service/rpc/", ТелоЗапроса, AuthТокен);
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	РезультатЗапроса = Неопределено;
	Ответ.Свойство("result", РезультатЗапроса);

	Возврат РезультатЗапроса;

КонецФункции

// Отправка результата обработки документа обратно в СБИС.
//
Функция ОтправитьРезультатСБИС(AuthТокен, ИдентификаторДокумента, Состояние, Комментарий = "")

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("jsonrpc", "2.0");
	ТелоЗапроса.Вставить("method", "СБИС.УстановитьСостояниеДокумента");
	ТелоЗапроса.Вставить("id", 3);

	Параметры = Новый Структура;
	Параметры.Вставить("Идентификатор", ИдентификаторДокумента);
	Параметры.Вставить("Состояние", Состояние);
	Параметры.Вставить("Комментарий", Комментарий);
	ТелоЗапроса.Вставить("params", Параметры);

	Ответ = ВыполнитьЗапросСБИС("https://online.sbis.ru/service/rpc/", ТелоЗапроса, AuthТокен);

	Возврат Ответ <> Неопределено;

КонецФункции

// Универсальный HTTP-клиент для запросов к СБИС (JSON-RPC 2.0).
//
Функция ВыполнитьЗапросСБИС(URL, ТелоЗапроса, AuthТокен = "")

	Попытка
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json-rpc;charset=utf-8");
		Если ЗначениеЗаполнено(AuthТокен) Тогда
			Заголовки.Вставить("X-SBIS-Session-Id", AuthТокен);
		КонецЕсли;

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
		ТелоФайла = ЗаписьJSON.Закрыть();

		СтруктураURL = РазобратьURL(URL);
		Соединение = Новый HTTPСоединение(
			СтруктураURL.Хост,
			СтруктураURL.Порт,
			, , ,
			30,
			СтруктураURL.Защищенное);

		ЗапросHTTP = Новый HTTPЗапрос(СтруктураURL.Путь, Заголовки);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоФайла, КодировкаТекста.UTF8);

		ОтветHTTP = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);

		Если ОтветHTTP.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС.HTTP",
				УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон("HTTP %1: %2", ОтветHTTP.КодСостояния,
					ОтветHTTP.ПолучитьТелоКакСтроку()));
			Возврат Неопределено;
		КонецЕсли;

		ТелоОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Ответ = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();

		Возврат Ответ;

	Исключение
		ЗаписьЖурналаРегистрации("АРМ_ЭДО.СБИС.HTTP",
			УровеньЖурналаРегистрации.Ошибка, , ,
			СтрШаблон("Ошибка HTTP-запроса к %1: %2",
				URL, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Разбор URL на компоненты (Хост, Порт, Путь, Защищенное).
//
Функция РазобратьURL(URL)

	Результат = Новый Структура("Хост, Порт, Путь, Защищенное", "", 80, "/", Ложь);

	НРегURL = НРег(URL);
	Если СтрНачинаетсяС(НРегURL, "https://") Тогда
		Результат.Защищенное = Истина;
		Результат.Порт = 443;
		ОстатокURL = Сред(URL, 9);
	ИначеЕсли СтрНачинаетсяС(НРегURL, "http://") Тогда
		ОстатокURL = Сред(URL, 8);
	Иначе
		ОстатокURL = URL;
	КонецЕсли;

	Слэш = СтрНайти(ОстатокURL, "/");
	Если Слэш > 0 Тогда
		ХостПорт = Лев(ОстатокURL, Слэш - 1);
		Результат.Путь = Сред(ОстатокURL, Слэш);
	Иначе
		ХостПорт = ОстатокURL;
		Результат.Путь = "/";
	КонецЕсли;

	Двоеточие = СтрНайти(ХостПорт, ":");
	Если Двоеточие > 0 Тогда
		Результат.Хост = Лев(ХостПорт, Двоеточие - 1);
		Результат.Порт = Число(Сред(ХостПорт, Двоеточие + 1));
	Иначе
		Результат.Хост = ХостПорт;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Получает настройку СБИС из регистра настроек.
//
Функция ПолучитьНастройкуСБИС(ИмяНастройки, ЗначениеПоУмолчанию)

	Попытка
		Значение = ЭАрМ_НастройкиСервер.ПолучитьНастройку("СБИС_" + ИмяНастройки);
		Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработка входящего ЭТРН.
//
// Параметры:
//   ВходящийЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - входящий документ
//
Процедура ОбработатьВходящийЭТрН(ВходящийЭДО)

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ОбработкаЭТрН",
		УровеньЖурналаРегистрации.Информация, , ВходящийЭДО,
		"Начало обработки входящего ЭТрН");

	// >>> Вставить логику обработки <<<

	ЗаписьЖурналаРегистрации("АРМ_ЭДО.ОбработкаЭТрН",
		УровеньЖурналаРегистрации.Информация, , ВходящийЭДО,
		"Обработка завершена");

КонецПроцедуры

// Проверяет, что тип документа поддерживается механизмом ЭДО-обмена.
//
Функция ЭтоПоддерживаемыйТипДокумента(ТипДокумента)

	Возврат ТипДокумента = Перечисления.ТипыДокументовЭДО.УПД
		ИЛИ ТипДокумента = Перечисления.ТипыДокументовЭДО.ЭТрН;

КонецФункции

// Находит электронные документы, связанные с объектом учёта.
//
Функция НайтиЭлектронныеДокументыПоОбъектуУчета(СсылкаНаОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ИЗ
	|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
	|ГДЕ
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета = &СсылкаНаОбъект
	|	И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент ССЫЛКА Документ.ЭлектронныйДокументВходящийЭДО";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ЭлектронныйДокумент");

КонецФункции

// Проверяет, что документ уже отправлен на подтверждение.
//
Функция УжеОтправленНаПодтверждение(ЭлектронныйДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	|ГДЕ
	|	Т.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти
